HELYXcore-4.4.0/modules/swak4Foam/Examples/tests/conditionalWriting/movingConeDistortedRandom/0/pointMotionUx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointScalarField;
    object      pointMotionU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    movingWall
    {
        type            groovyBC;
        value           uniform 1;
        valueExpression "toPoint(sin(pi*time()/0.006))*(toPoint(0.2)+pts().y*toPoint(1.2e2))";
    }
    farFieldMoving
    {
        type            slip;
    }
    fixedWall
    {
        type            fixedValue;
        value           uniform 0;
    }
    axis
    {
        type            symmetryPlane;
    }
    left
    {
        type            fixedValue;
        value           uniform 0;
    }
    farField
    {
        type            slip;
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
}

// ************************************************************************* //
